# yolov8n-cbam-p2.yaml - 终极版：CBAM 注意力机制 + 四头小目标检测

nc: 3  # 类别数量
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2 <--- 关键节点 P2 (高分辨率，保留最多小目标细节)
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4 <--- 关键节点 P3
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6 <--- 关键节点 P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 1, CBAM, [1024]]       # 10 <--- 之前加的 CBAM 注意力机制

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 16

  # ================= 新增的 P2 小目标专属检测分支 =================
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # 强行拉取第 2 层的超高清 P2 特征
  - [-1, 3, C2f, [128]]  # 19 <--- 新增的输出头1 (专门抓取极小 Logo)
  # ================================================================

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 22 <--- 输出头2 (小目标)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]  # 25 <--- 输出头3 (中目标)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # 连接带有 CBAM 的第 10 层
  - [-1, 3, C2f, [1024]] # 28 <--- 输出头4 (大目标)

  # 最终汇聚 4 个检测头！
  - [[19, 22, 25, 28], 1, Detect, [nc]]  # 29